{
    "no": 12,
    "content": [
            "야자시(夜子時)는 명리학계의 주요한 논쟁거리중 하나입니다. 야자시는 子시를 나누어 야자시와 조자시(朝子時)로 봐야한다는 주장입니다. 특히 명리학의 거두인 이석영 선생이 야자시를 사용하고 주장한 것으로 유명합니다.",
            "먼저 야자시에 관한 몇가지 잘못된 속설을 짚고 넘어가겠습니다. 전통적으로 야자시를 사용한 적이 없는데 근대로 넘어오면서 서양의 24시간 체계가 들어와 야자시를 만들어 냈다는 주장이 있습니다. 야자시에 대한 사례는 근대 이전 다양한 기록에 나옵니다. 또 0시에 해당하는 야반(夜半)이라는 표현도 이미 오래전부터 역법에서 사용되어 왔습니다. 아래 인용된 것처럼 대표적인 명리서적 삼명통회에도 나오는 표현입니다. 따라서 야자시는 서양의 24시간 체계와는 관계가 없고 당연히 일본식 개념도 아닙니다. 이는 명백히 잘못된 속설입니다.",
            "아래는 삼명통회 2권 논시각(論時刻)편에 나오는 야자시에 대한 내용입니다.",        
          "夫晝夜十二時，均分百刻，一時有八大刻、二小刻，大刻總九十六，小刻總二十四，小刻六，凖大刻一，故共為百刻也。\n무릇 주야 12時辰을 100刻으로 균등하게 나누면 1시진은 8大刻 2小刻이다. 大刻은 총 96개이며 小刻은 총 24개이다. 小刻 6개는 大刻 1개에 준하기 때문에 합하여 100刻이 된다.\n\n上半時之大刻四，始曰初初，次初一，次初二，次初三，最後小刻為初四。\n상반시(上半時)는 大刻이 4개인데, 처음은 초초(初初), 그 다음을 초일(初一), 그 다음을 초이(初二), 그 다음을 초삼(初三), 마지막은 小刻으로 초사(初四)가 된다.\n下半時之大刻亦四，始曰正初，次正一，次正二，次正三，最後小刻為正四。\n하반시(下半時)는 大刻이 또한 4개인데, 처음은 정초(正初), 그 다음을 정일(正一)，그 다음을 정이(正二), 그 다음을 정삼(正三), 마지막은 小刻으로 정사(正四)가 된다.\n\n若子時，則上半時在夜半前，屬昨日，下半時在夜半後，屬今日。\n만약 자시(子時)라면 상반시는 야반(夜半) 전으로 어제에 속하고 하반시는 야반 후로 오늘에 속한다.\n\n亦猶冬至，得十一月中氣，一陽來復，為天道之初耳。\n또한 동지에 11월 중기(中氣)가 되면 일양(一陽)이  돌아와 천도(天道)의 처음이 된다.\n\n古曆每時以二小刻為始，乃各繼以四大刻，然不若今曆之便於籌策也。\n옛 달력은 매 시간 2小刻으로 시작하여 4大刻으로 이어졌다. 그러나 주책(籌策)을 사용하는 지금 달력의 편리함만 못하다.\n\n世謂子午卯酉各九刻，餘皆八刻，非是。\n세간에서 말하길 자오모유(子午卯酉)는 각 9刻이고 나머지는 8刻이라고 하나 옳지 않다.\n\n(中略)\n\n論曰：看命之法，以時為低昂，時有八刻，初正之氣不同，初者其朔氣也，正者其中氣也，故用時之法，每用其正，若癸為子下四刻，艮為丑下四刻，以其得天干之正氣焉。\n간명법은 시간에 따라 낮아지고 높아진다. 시진에는 8刻이 있고 초정(初正)의 氣는 동일하지 않다. 初는 삭기(朔氣)이고 正은 중기(中氣)이기 때문에 시법(時法)을 적용하여 매번 그 正을 사용한다. 가령 癸는 子 하반시의 4刻이고 艮은 丑 하반시의 4刻인데, 이로써 天干의 正를 얻는 것이다.\n\n若初則帶先時之氣，未占後時之氣，况夜半不分，其日頓差，子亥中間，厥時難定，除初初正四刻，餘六刻之間，或陰晴倐忽，寒煖逈別，人之生時果得其當也耶。\n만약 初라면 앞의 時의 기운를 띠고 아직 뒤의 時의 기운은 점하지 못한다. 하물며 야반(夜半)은 불분명하고 그 날의 차이가 있어 子亥의 중간인 삭시(厥時)에는 정하기 어려우니 初初正四의 刻을 제하고 6刻을 남긴다. 혹여 흐림과 밝음이 갑작스럽거나 춥고 따듯함이 확연히 다르면 사람의 생시(生時)는 그 마땅함을 얻는 것이다.\n\n余姑就授時曆分之，要在智者密察而詳問之，庶無悞矣。\n내가 잠시 시간력을 다루어 분별하였는데, 요컨대 지혜로운 자가 있어 면밀히 살피고 상세히 묻는다면 잘못됨은 하나도 없을 것이다.",
          "이중에서 [若子時，則上半時在夜半前，屬昨日，下半時在夜半後，屬今日。]라는 문구가 야자시의 강력한 논거로 쓰입니다. 이 문구만 해석하면 삼명통회는 야자시를 명확히 인정하는 것으로 보입니다. 하지만 마지막 간명법을 설명하면서는 결이 다른 주장을 합니다. 야반(夜半)은 불분명하고 야자시에 해당하는 상반시 初는 제하고 하반시 正으로 時를 정한다는 것입니다. 즉 모든 時辰은 하반시 正에 따라 전체의 시간을 정한다는 뜻입니다. 다시 말해 이 글의 전반부는 시진을 刻으로 보다 세밀히 나누는 이치를 설명한 것이고 후반부는 간명할 때 시진을 刻으로 나누지 않는 이치를 설명한 것입니다. 글의 전체적인 맥락을 보자면 오히려 시진을 야자시로 나누어 간명하지 말라는 내용에 가깝습니다.",
          "사주에서 월주(月柱)는 년간(年干)과 연결되고 시주(時柱)는 일간(日干)과 연결되어 있습니다. 예를 들어, 甲년이면 丙寅월부터 시작하고 乙년이면 戊寅월부터 시작합니다. 마찬가지로 甲 일간이면 甲子시부터 시작하고 乙 일간이면 丙子시부터 시작합니다. 이를 각 월두법(月頭法)과 시두법(時頭法)이라고 부릅니다. 만약 야자시를 적용하면 甲 일간에 甲子 조자시 외에 丙子 야자시가 연결되어 전통적으로 사주를 세우는 공식인 시두법은 깨집니다.",
        "地支만 구분하면 子시를 나누어도 총 12개의 시진으로 칠 수 있지만 천간까지 결합해 구분하면 총 13개의 시진으로 나뉘는 것입니다. 甲子시와 丙子시는 엄연히 다른 시간이고 이것이 하루에 포함된다는 것은 어딘가 궁색한 일입니다. 10과 12의 곱으로 이루어진 60갑자에서 13이라는 숫자는 사주의 균형을 무너뜨립니다."
    ]
}
