{
    "no": 6,
    "content": [        
        "삼명통회에는 정확한 대운의 날짜를 구하는 공식이 아래와 같이 설명되어 있습니다.",
        "옛사람들이 대운 1辰을 10년으로 여기고, 3日을 1년으로 치환하는 것은 왜 그러한가? (古人以大運則一辰十歲，折除以三日爲年者何？)",
        "대개 한 달은 달이 차고 이지러지는 30일이고, 하루는 낮과 밤이 돌아가는 12시진(時辰 = 2시간)이다. 총 10년의 운기가 있는데, 무릇 3일은 36시진이고 360일은 1년이다. 한 달은 360시진이고 절기를 치환하면 3600일로 1辰 10년이다. (蓋一月之終 晦朔周而有三十日, 一日之終 晝夜周而有十二時, 總十年之運氣，凡三日有三十六時，乃見三百六十日，爲一歲之數。在一月之中有三百六十時，折除節氣算，計三千六百日爲一辰之十歲也。)",
        "사람의 생은 120세를 천명으로 하는데 그 환산하는 법을 논하려면 반드시 역(曆)을 계산해 일시를 세고 절기의 수를 세야 한다.(人生以百二十歲爲周天, 論折除之法，必用生者實曆，過日時數其節氣之數。)",
        "양남음녀(陽男陰女)는 대운이 태어난 날부터 다음 절기의 일시까지를 세니 순행하고, 음남양녀(陰男陽女)는 대운이 생일부터 이전 절기의 일시까지를 세니 역행한다. (陽男陰女，大運以生日後未來節氣日時爲數，順而行之。陰男陽女，大運以生日前過去節氣日時爲數，逆而行之。)",
        "가령 甲子년 양남(陽男)이 (음력) 11월 24일 巳時에 출생했다면 이달은 29일 申時가 입춘이다. (假如甲子陽男，十二月二十四日巳時生，是月也，二十九日申時立春。)",
        "양남의 (대운)수는 다음 절기까지이고 24일 巳時부터 25일 巳時까지를 온전한 하루로 셈한다. (陽男數以未來之日，自二十四日巳時至二十五日巳時，方是一日之實數。)",
        "29일 申時에 이르기까지 정확히 5일 3시진(時辰)을 얻으니 63시진으로 계산한다.(至二十九日申時，正得五日三時之節氣，實曆過六十三時。)",
        "63시진을 치환해 630일로 환산하면 1년 9개월의 대운이 丁丑월에서 일어나는 것이다. 반드시 12월 태어난 날로부터 21개월을 지나고 이 시기 대운이 궁(宮)을 옮긴다. 이는 3세 9개월의 나이로 이 갑자년 12월생은 1년 9개월의 대운이 움직인다. (折除過六十三時，折除計六百三十日，乃一歲奇九月之大運起於丁丑，必自十二月生日後，實經曆過二十有一，是日月運方移宮，是越三歲九月之內，方是甲子十二月生，行一歲奇九月之大運也。)",
        "요즘 사람들은 대운을 세울 때 많은 사람이 약식법을 사용해 논한다. 1년 8개월 대운을 편의로 2년으로 바꾸는데, 역산(曆算)에 대해 특히 알지 못하는 것이다. (今人行運，多用約法論，以一歲奇八月起運，便以二歲，殊不明折除實曆之數也。)",
        "이 이론은 절기 30일을 10년으로 보는 데서 출발합니다. 3일은 1년으로 치환하고 1일은 120일로 치환하고 1時辰(=2시간)은 10일로 치환합니다. 이를 토대로 정밀하게 대운 날짜를 계산할 수 있다는 주장입니다.",
        "음력을 사용하던 시절 양력으로 변환해서 계산하는 등 매우 정밀한 계산을 시도하고 있습니다만, 어디까지나 절기를 30일로 가정한 계산법입니다. 실제 절기의 길이를 측정하면 공전 주기의 불규칙성으로 인해 30일이 못 되거나 혹은 32일을 넘기는 경우까지 있습니다. 위의 날짜치환법에 대입하면 2일의 차이는 무려 240일이나 됩니다.",
        "또 생일에서부터 대운을 더해 구하는 방식은 여기에서 비판하는 약식법과 매우 심각한 차이를 만듭니다. 절기의 말초에 태어난 사람이 큰수의 대운을 얻는 경우 약식법과 거의 2년 정도의 오차가 생깁니다. 약식법에서 얻은 대운의 첫 세운은 대개 과거의 대운으로 소속이 바뀝니다. 이 정도 오차가 있다면 약식법이 대표적인 계산법으로 꾸준히 전승될 수 있었을지 의문입니다.",
        "대운은 월주에서 출발하고 월주는 지구의 공전을 의미합니다. 절기의 어느 지점에서 태어났는지 계산하는 것은 공전하고 있는 지구의 정확한 위치를 측정하는 일입니다. 따라서 중요한 것은 비율이고 비율이 곧 대운수입니다. 이런 관점에서 보면 날수를 계산하는 삼명통회의 계산보다 반올림하여 비율를 구하는 약식법이 대운수를 구하는 취지에 맞습니다.",
        "삼명통회는 고법(古法)에 대한 이론이 많습니다. 윗글에서 요즘 사람들로 치부한 신법(新法)에 의해 명리는 다듬어지고 발전합니다. 고법을 무조건 받아들일 수는 없습니다. 반대로 간단히 무시할 수도 없습니다.",
        "삼명통회의 이론을 현대적인 절기 데이터와 결합해 더욱 정확한 날짜를 계산할 수 있습니다. 도사노트에 표기되고 있는 대운수의 소수점은 그런 의도로 표기됩니다. 소수점까지 표현된 대운수에 365.24를 곱하면 대운의 일수가 대략적으로 나옵니다. 태어난 날에 이 일수를 더하면 삼명통회에서 말하는 대운의 날짜가 나오는데 소수점 둘째자리에서 반올림하기 때문에 한두달의 오차는 있습니다. 대략적인 계산을 위해 표기하였습니다."
    ]
}
