{
    "chapter": 48,
    "content": [
        "雜格不一，大都氣勢偏旺，出於五行常理之外。昔人評命，泥於財官之說，四柱無財可取，則不惜遙合倒沖，牽強附會，以期合於財官，未免可嗤。命理不外乎五行，氣勢雖爲偏旺，而偏旺之中，仍有正理可取，詳《滴天髓征義》。偏旺之格，取運大都須順其氣勢，雖干支喜忌，須察四柱之配合，而順勢取運，大致有定。茲就本篇所引各造。約略言之：",
        "曲直仁壽格 : 癸亥 乙卯 乙未 壬午 (運) 甲寅 癸丑 壬子 辛亥 庚戌 己酉",
        "甲乙日主，支全亥卯未或寅卯辰，乃曲直仁壽格也。氣勢偏旺於木，宜行水木火運，官煞運最忌，財運亦不宜。丙丁日主，支全寅午戌、或巳午未，爲炎上格。戊已日主，支全辰戌丑未爲稼穡格。庚辛日主，支全巳酉丑或申酉戌，爲從革格。壬癸日主支全甲子辰或亥子丑，爲潤下格。五種意義相同。",
        "化氣格：甲戌 丁卯 壬寅 甲辰 (運) 戊辰 己巳 庚午 辛未 壬申 癸酉",
        "丁壬化木，生於春月，時逢甲辰，木之元神透出，乃化木格。氣勢偏於木也。化神喜行旺地，最宜東方寅卯辰比劫鄉，而忌官煞，日主還原之地亦忌，其中略分別，如丁壬化木，日元壬水，行亥子丑印地，生起化神亦吉；若甲已化土，而行寅卯辰，剋我化神，爲大忌也。化氣格有甲己化土、乙庚化金、丙辛化水、丁壬化木、戊癸化火五種，意義略同。",
        "倒沖格：戊午 戊午 戊午 戊午 (運) 己未 庚申 辛酉 壬戌 癸亥 甲子",
        "兩神成象，而氣勢偏於火土，爲從旺格。最宜金運，泄土之氣，但火炎土燥，究嫌偏枯，宜帶水之土以護之。如庚辰、辛丑等運爲最佳，若見水運，如以一杯水救車薪之火。立見其災。所謂倒沖最忌填實，即此意也。木運逆土之性，增火之焰，亦不相宜。",
        "甲寅 庚午 丙午 甲午 (運) 辛未 壬申 癸酉 甲戌 乙亥 丙子",
        "庚金無根，置之不論，氣偏木火，格成炎上，最宜土運泄火之氣。說見前仁壽格。",
        "以上兩造皆俗所謂倒沖格也。",
        "朝陽格：戊辰 辛酉 辛酉 戊子 (運) 壬戌 癸亥 甲子 乙丑 丙寅 丁卯",
        "此金水傷官，原無官星，氣勢偏於金水，以順其性。行土金水運爲美，火運爲忌。帶水之木尚可行，而帶火之木則不宜見。此俗所謂朝陽格也。",
        "合祿格：己未 戊辰 戊辰 庚申 (運) 丁卯 丙寅 乙丑 甲子 癸亥 壬戌",
        "此土金食神也。比劫重重，氣勢偏於土金，以金運泄土之秀爲最吉，水運亦美，火運爲忌，木亦不美，所謂土盛木折也。俗以庚合乙爲官星，稱爲合祿格，又不要明見，喜財以生之。取運略同。",
        "合祿格：己酉 辛未 癸未 庚申 (運) 庚午 己巳 戊辰 丁卯 丙寅 乙丑",
        "俗亦名之爲合祿格，以申合巳中戊土爲官星也。月令偏官，年上透出，時上庚印化煞爲用（見論偏官篇），格正局清，有何不美？若取巳中戊土官星，豈非官煞混雜耶？",
        "從財格：庚申 乙酉 丙申 己丑 (運) 丙戌 丁亥 戊子 己丑 庚寅 辛卯",
        "乙從庚化，不作印論，丙火臨申，坐於病地，四柱無根，時上己丑又來生金，氣勢偏於金旺，爲棄命從財格也。運宜行土金水，南方火鄉最忌，木亦不利。",
        "從煞格：乙酉 乙酉 乙酉 甲申 (運) 甲申 癸未 壬午 辛巳 庚辰 己卯",
        "乙木無根，氣勢偏於金，爲棄命從煞格。金運最美，水土亦吉。木運爲乙木逢根，火運逆其旺勢，皆忌見。與上從財格大致相同。",
        "井欄叉格：戊子 庚申 庚申 庚辰 (運) 辛酉 壬戌 癸亥 甲子 乙丑 丙寅",
        "此俗所謂井欄叉格。庚金乘旺泄秀，支全申子辰水局。氣勢偏於金水，當順其勢以取運。土金水運均美，木運亦可，行火運逆其旺勢不利。",
        "遙合格：辛丑 辛丑 辛丑 庚寅 (運) 庚子 己亥 戊戌 丁酉 丙申 乙未",
        "此俗所謂丑遙巳格。土金成局，生於十二月，時上寅木無氣，不能爲用。勢象偏於土金，宜土金水運，木火逆其旺勢爲不宜。與遙巳格取運相同也。",
        "丑遙巳祿格（又名刑合）：乙未 癸卯 癸卯 甲寅 (運) 壬寅 辛丑 庚子 己亥 戊戌 丁酉",
        "《喜忌篇》雲，“癸日進逢寅位，歲月怕戊已二方”，以寅刑出巳中戊土爲格，其實乃從兒格也。氣勢偏於木，行運最喜木火。從格忌見比劫，而從兒有食傷引化，不忌比劫，此爲不同之點。官煞大忌，印運亦忌。",
        "子遙巳祿格（又名遙合格）：甲申 甲戌 甲子 甲子 (運) 乙亥 丙子 丁丑 戊寅 己卯 庚辰",
        "《喜忌篇》雲，“甲子日再遇子時，畏庚辛申酉丑午，以子遙合巳爲格”，其實月令偏財，用財損印，何必另取格局？戌藏丁火，生起財星，遇運透清爲美，庚辛申酉官煞生印爲忌，午沖子、丑刑戌均爲忌也。",
        "終"
    ],
    "content2": []
}
