[
    {
        "chapter": 1,
        "content": [
            "天地之間，一氣而已。惟有動靜，遂分陰陽。有老少，遂分四象。老者極動靜之時，是爲太陽太陰；少者初動初靜之際，是爲少陰少陽。有是四象，而五行具於其中矣。水者，太陰也；火者，太陽也；木者，少陽也；金者，少陰也；土者，陰陽老少、木火金水沖氣所結也。",
            "有是五行，何以又有十干十二支乎？蓋有陰陽，因生五行，而五行之中，各有陰陽。即以木論，甲乙者，木之陰陽也。甲者，乙之氣；乙者，甲之質。在天爲生氣，而流行於萬物者，甲也；在地爲萬物，而承茲生氣者，乙也。又細分之，生氣之散布者，甲之甲，而生氣之凝成者，甲之乙；萬木之所以有枝葉者，乙之甲，而萬木之枝枝葉葉者，乙之乙也。方其爲甲，而乙之氣已備；及其爲乙，而甲之質乃堅。有是甲乙，而木之陰陽具矣。",
            "何以復有寅卯者，又與甲乙分陰陽天地而言之者也。以甲乙而分陰陽，則甲爲陽，乙爲陰，木之行於天而爲陰陽者也。以寅卯而陰陽，則寅爲陽，卯爲陰，木之存乎地而爲陰陽者也。以甲乙寅卯而統分陰陽，則甲乙爲陽寅卯爲陰，木之在天成象而在地成形者也。甲乙行乎天，而寅卯受之；寅卯存乎也，而甲乙施焉。是故甲乙如官長，寅卯如該管地方。甲祿於寅，乙祿於卯，如府官之在郡，縣官之在邑，而各司一月之令也。",
            "甲乙在天，故動而不居。建寅之月，豈必當甲？建卯之月，豈必當乙？寅卯在地，故止而不遷。甲雖遞易，月必建寅；乙雖遞易，月必建卯。以氣而論，甲旺於乙；以質而論，乙堅於甲。而俗書謬論，以甲爲大林，盛而宜斬，乙爲微苗，脆而莫傷，可爲不知陰陽之理者矣。以木類推，余者可知，惟土爲木火金水沖氣，故寄旺於四時，而陰陽氣質之理，亦同此論。欲學命者，必須先知干支之說，然後可以入門。"
        ],
        "content2": []
    },
    {
        "chapter": 2,
        "content": [
            "四時之運，相生而成，故木生火，火生土，土生金，金生水，水復生木，即相生之序，循環迭運，而時行不匱。然而有生又必有剋，生而不剋，則四時亦不成矣。剋者，所以節而止之，使之收斂，以爲發泄之機，故曰“天地節而四時成”。即以木論，木盛於夏，殺於秋，殺者，使發泄於外者藏收內，是殺正所以爲生，大易以收劍爲性情之實，以兌爲萬物所說，至哉言乎！譬如人之養生，固以飲食爲生，然使時時飲食，而不使稍飢以待將來，人壽其能久乎？是以四時之運，生與剋同用，剋與生同功。",
            "然以五行而統論之，則水木相生，金木相剋。以五行之陰陽而分配之，則生剋之中，又有異同。此所以水同生木，而印有偏正；金同剋木，而局有官煞也。印綬之中，偏正相似，生剋之殊，可置勿論；而相剋之內，一官一煞，淑慝判然，其理不可不細詳也。",
            "即以甲乙庚辛言之。甲者，陽木也，木之生氣也；乙者，陰木也，木之形質也。庚者，陽金也，秋天肅殺之氣也；辛者，陰金也，人間五金之質也。木之生氣，寄於木而行於天，故逢秋天爲官，而乙則反是，庚官而辛殺也。又以丙丁庚辛言之。丙者，陽火也，融和之氣也；丁者，陰火也，薪傳之火也。秋天肅殺之氣，逢陽和而剋去，而人間之金，不畏陽和，此庚以丙爲殺，而辛以丙爲官也。人間金鐵之質，逢薪傳之火而立化，而肅殺之氣，不畏薪傳之火。此所以辛以丁爲殺，而庚以丁爲官也。即此以推，而余者以相剋可知矣。"
        ],
        "content2": []
    },
    {
        "chapter": 3,
        "content": [
            "五行干支之說，已詳論於干支篇。干動而不息，支靜而有常。以每幹流行於十二支之月，而生旺墓絕系焉。",
            "陽主聚，以進爲進，故主順；陰主散，以退爲退，故主逆。此生沐浴等項，所以有陽順陰逆之殊也。四時之運，功成者去，等用者進，故每流行於十二支之月，而生旺墓絕，又有一定。陽之所生，即陰之所死，彼此互換，自然之運也。即以甲乙論，甲爲木之陽，木之枝枝葉葉，受天生氣，己收藏飽足，可以爲來剋發泄之機，此其所以生於亥也。木當午月，正枝葉繁盛之候，而甲何以死？卻不是外雖繁盛，而內之生氣發泄已盡，此其所以死於午也。乙木反是，午月枝葉繁盛，即爲之生，亥月枝葉剝落，即爲之死。以質而論，自與氣殊也。以甲乙爲例，余可知矣。",
            "支有十二月，故每干長生至胎養，亦分十二位。氣之由盛而衰，衰而復盛，逐節細分，遂成十二。而長生沐浴等名，則假借形容之詞也。長生者，猶人之初生也。沐浴者，猶人既生之後，而沐浴以去垢；如果核既爲苗，則前之青殼，洗而去之矣。冠帶者，形氣漸長，猶人之年長而冠帶也。臨官者，由長而壯，猶人之可以出仕也。帝旺者，壯盛之極，猶人之可以輔帝而大有爲也。衰者，盛極而衰，物之初變也。病者，衰之甚也。死者，氣之盡而無餘也。墓者，造化收藏，猶人之埋於土者也。絕者，前之氣已絕，后之氣將續也。胎者，后之氣續而結聚成胎也。養者，如人養母腹也。自是而後，長生循環無端矣。",
            "人之日主，不必生逢祿旺，即月令休囚，而年日時中, 得長祿旺，便不爲弱，就使逢庫，亦爲有根。時產謂投庫而必沖者，俗書之謬也，但陽長生有力，而陰長生不甚有力，然亦不弱。若是逢庫，則陽爲有根，而陰爲無用。蓋陽大陰小，陽得兼陰，陰不能兼陽，自然之理也。"
        ],
        "content2": []
    },
    {
        "chapter": 4,
        "content": [
            "合化之義，以十干陰陽相配而成。河圖之數，以一二三四五配六七八十，先天之道也。故始於太陰之水，而終於沖氣之土，以氣而語其生之序也。蓋未有五行之先，必先有陰陽老少，而後沖氣，故生以土。終之既有五行，則萬物又生於土，而水火木金，亦寄質焉，故以土先之。是以甲己相合之始，則化爲土；土則生金，故乙庚化金次之；金生水，故丙辛化水又次之；水生木，故丁壬化木又次之；木生火，故戊癸化火又次之，而五行遍焉。先之以土，相生之序，自然如此。此十干合化之義也。",
            "其性情何也？蓋既有配合，必有向背。如甲用辛官，透丙作合，而官非其官；甲用癸印，透戊作合，而印非其印；甲用己財，己與別位之甲作合，而財非其財。如年己月甲，年上之財，被月合去，而日主之甲乙無分；年甲月己，月上之財，被年合去，而日主之甲乙不與是也。甲用丙食與辛作合，而非其食，此四喜神因合而無用者也。",
            "又如甲逢庚爲煞，與乙作合，而煞不攻身；甲逢乙爲劫財，甲逢丁爲傷，與壬作合，而丁不爲傷官；甲逢壬爲梟，與丁作合，而壬不奪食。此四忌神因合化吉者也。",
            "蓋有所合則有所忌，逢吉不爲吉，逢凶不爲凶。即以六親言之，如男以財爲妻，而被別干合去，財妻豈能親其夫乎？女以官爲夫，而被他干合去，官夫豈能愛其妻乎？此謂配合之性情，因向背而殊也。"
        ],
        "content2": []
    },
    {
        "chapter": 5,
        "content": [
            "十干化合之義，前篇既明之矣，然而亦有合而不合者，何也？",
            "蓋隔於有所間也，譬如人彼此相好，而有人從中間之，則交必不能成。譬如甲與己合，而甲己中間，以庚間隔之，則甲豈能越剋我之庚而合己？此制於勢然也，合而不敢合也，有若無也。",
            "又有隔位太遠，如甲在年干，己在時上，心雖相契，地則相遠，如人天南地北，不能相合一般。然於有所制而不敢合者，亦稍有差，合而不能合也，半合也，其爲禍福得十之二三而已。",
            "又有合而無傷於合者，何也？如甲生寅卯，月時兩透辛官，以年丙合月辛，是爲合一留一，官星反輕。甲逢月刃，庚辛並透，丙與辛合，是爲合官留煞，而煞刃依然成格，皆無傷於合也。",
            "又有合而不以合論者，何也？本身之合也。蓋五陽逢財，五陰遇官，俱是作合，惟是本身十干合之，不爲合去。假如乙用庚官，日干之乙，與庚作合，是我之官，是我合之。何爲合去？若庚在年上，乙在月上，則月上之乙，先去合庚，而日干反不能合，是爲合去也。又如女以官爲夫，丁日逢壬，是我之夫，是我合之，正如夫妻相親，其情愈密。惟壬在月上，而年丁合之，日干之丁，反不能合，是以己之夫星，被姊妹合去，夫星透而不透矣。",
            "然又有爭合妒合之說，何也？如兩辛合丙，兩丁合壬之類，一夫不娶二妻，一女不配二夫，所以有爭合妒合之說。然到底終有合意，但情不專耳。若以兩合一而隔位，則全無爭妒。如庚午、乙酉、甲子、乙亥，兩乙合庚，甲日隔之，此高太尉命，仍作合煞留官，無減福也。",
            "化氣有真有假。上兩造爲化氣之真者，亦有化氣有餘，而日帶根苗劫印者；有日主無根，而化神不足者；更有合化雖真，而閑神來傷化氣者，皆爲假化。"
        ],
        "content2": []
    },
    {
        "chapter": 6,
        "content": [
            "書雲，得時俱爲旺論，失時便作衰看，雖是至理，亦死法也。然亦可活看。夫五行之氣，流行四時，雖日干各有專令，而其實專令之中，亦有並存者在。假若春木司令，甲乙雖旺，而此時休囚之戊己，亦嘗艷於天地也。特時當退避，不能爭先，而其實春土何嘗不生萬物，冬日何嘗不照萬國乎？",
            "況八字雖以月令爲重，而旺相休囚，年月日時，亦有損益之權，故生月即不值令，而年時如值祿旺，豈便爲衰？不可執一而論。猶如春木雖強，金太重而木亦危。干庚辛而支酉丑，無火制而晃富，逢土生而必夭，是以得時而不旺也。秋木雖弱，木根深而木亦強。干甲乙而支寅卯，遇官透而能受，逢水生而太過，是失時不弱也。",
            "是故十干不論月令休囚，只要四柱有根，便能受財官食神而當傷官七煞。長生祿旺，根之重者也；墓庫餘氣，根之輕者也。得一比肩，不如得支中一墓庫，如甲逢未、丙逢戌之類。乙逢戌、丁逢丑、不作此論，以戌中無藏木，丑中無藏火也。得二比肩，不如得一餘氣，如乙逢辰、丁逢未之類。得三比肩，不如得一長生祿刃，如甲逢亥子寅卯之類。陰長生不作此論，如乙逢午、丁逢酉之類，然亦爲明根，比得一餘氣。蓋比劫如朋友之相扶，通根如室家之可住；干多不如根重，理固然也。",
            "今人不知命理，見夏水冬火，不問有無通根，便爲之弱。更有陽干逢庫，如壬逢辰、丙坐戌之類，不以爲水火通根身庫，甚至求刑沖開之。此種謬論，必宜一切掃除也。"
        ],
        "content2": []
    },
    {
        "chapter": 7,
        "content": [
            "刑者，三刑也，子卯巳申子類是也。沖者，六衝也，子午卯酉之類是也，會者，三會也，申子辰之類是也。合者，六合也，子與丑合之類是也。此皆以地支宮分而言，系對射之意也。三方爲會，朋友之意也。並對爲合，比鄰之意也。至於三刑取廡，姑且闕疑，雖不知其所以然，於命理亦無害也。",
            "八字支中，刑沖俱非美事，而三合六合，可以解之。假如甲生酉月，逢卯則沖，而或支中有戌，則卯與戌合而不沖；有辰，則酉與辰合而不沖；有亥與未，則卯與亥未會而不沖；有巳與丑，則酉與巳丑會而不沖。是會合可以解沖也。又如丙生子月，逢卯則刑，而或支中有戌，則與戌合而不刑；有丑，則子與丑合而不刑；有亥與未，則卯與亥未會而不刑；有申與辰，則子與申辰會而不刑。是會合可以解刑也。",
            "又有因解而反得刑沖者，何也？假如甲生子月，支逢二卯相併，二卯不刑一子，而支又逢戌，戌與卯合，本爲解刑，而合去其一，則一合而一刑，是因解而反得刑沖也。",
            "又有刑沖而會合不能解者，何也？假如子年午月，日坐丑位，丑與子合，可以解沖，而時逢巳酉，則丑與巳酉會，而子復沖午；子年卯月，日坐戌位，戌與卯合，可以解刑，而或時逢寅午，則戌與寅午會，而卯復刑子。是會合而不能解刑沖也。",
            "更有刑沖而可以解刑者，何也？蓋四柱之中，刑沖俱不爲美，而刑沖用神，尤爲破格，不如以另位之刑沖，解月令之刑沖矣。",
            "假如丙生子月，卯以刑子，而支又逢酉，則又與酉沖不刑月令之官。甲生酉月，卯日沖之，而時逢子立，則卯與子刑，而月令官星，沖之無力，雖於別宮刑沖，六親不無刑剋，而月官猶在，其格不破。是所謂以刑沖而解刑沖也。",
            "如此之類，在人之變化而己。"
        ],
        "content2": []
    },
    {
        "chapter": 8,
        "content": [
            "八字用神，專求月令，以日干配月令地支，而生剋不同，格局分焉。財官印食，此用神之善而順用之者也；煞傷劫刃，用神之不善而逆用之者也。當順而順，當逆而逆，配合得宜，皆爲貴格。",
            "是以善而順用之，則財喜食神以相生，生官以護財；官喜透財以相生，生印以護官；印喜官煞以相生，劫才以護印；食喜身旺以相生，生財以護食。不善而逆用之，則七煞喜食神以制伏，忌財印以資扶；傷官喜佩印以制伏，生財以化傷；陽刃喜官煞以制伏，忌官煞之俱無；月劫喜透官以制伏，利用財而透食以化劫。此順逆之大路也。",
            "今人不知專主提綱，然後將四柱干支，字字統歸月令，以觀喜忌，甚至見正官佩印，則以爲官印雙全，與印綬用官者同論；見財透食神，不以爲財逢食生，而以爲食神生財，與食神生財同論；見偏印透食，不以爲泄身之秀，而以爲梟神奪食，宜用財制，與食神逢梟同論；見煞逢食制而露印者，不爲去食護煞，而以爲煞印相生，與印綬逢煞者同論；更有煞格逢刃，不以爲刃可幫身制煞，而以爲七煞制刃，與陽刃露煞者同論。此皆由不知月令而妄論之故也。",
            "然亦有月令無用神者，將若之何？如木生寅卯，日與月同，本身不可爲用，必看四柱有無財官煞食透干會支，另取用神；然終以月令爲主，然後尋用，是建祿月劫之格，非用而即用神也。"
        ],
        "content2": []
    },
    {
        "chapter": 9,
        "content": [
            "用神專尋月令，以四柱配之，必有成敗。何謂成？如官逢財印，又無刑衝破害，官格成也。財生官旺，或財逢食生而身強帶比，或財格透印而位置妥貼，兩不相剋，財格成也。印輕逢煞，或官印雙全，或身印兩旺而用食傷泄氣，或印多逢財而財透根輕，印格成也。食神生財，或食帶煞而無財，棄食就煞而透印，食格成也。身強七煞逢制，煞格成也。傷官生財，或傷官佩印而傷官旺，印有根，或傷官旺、身主弱而透煞印，或傷官帶煞而無財，傷官格成也。陽刃透官煞而露財印，不見傷官，陽刃格成也。建祿月劫，透官而逢財印，透財而逢食傷，透煞而遇制伏，建祿月劫之格成也。",
            "何謂敗？官逢傷剋刑沖，官格敗也；財輕比重，財透七煞，財格敗也；印輕逢財，或身強印重而透煞，印格敗也；食神逢梟，或生財露煞，食神格敗也；七煞逢財無制，七煞格敗也；傷官非金水而見官，或生財生帶煞，或佩印而傷輕身旺，傷官格敗也；陽刃無官煞，刃格敗也；建祿月劫，無財官，透煞印，建祿月劫之格敗也。",
            "成中有敗，必是帶忌；敗中有成，全憑救應。何謂帶忌？如正官逢財而又逢傷；透官而又逢合；財旺生官而又逢傷逢合；印透食以泄氣，而又遇財露；透煞以生印，而又透財，以去印存煞；食神帶煞印而又逢財；七煞逢食制而又逢印；傷官生財而財又逢合；佩印而印又遭傷，透財而逢煞，是皆謂之帶忌也。",
            "何謂救應？如官逢傷而透印以解之，雜煞而合煞以清之，刑沖而會合以解之；財逢劫而透食以化之，生官以制之，逢煞而食神制煞以生財，或存財而合煞；印逢財而劫財以解之，或合財而存印；食逢梟而就煞以成格，或生財以護食；煞逢食制，印來護煞，而逢財以去印存食；傷官生財透煞而煞逢合；陽刃用官煞帶傷食，而重印以護之；建祿月劫用官，遇傷而傷被合，用財帶煞而煞被合，是謂之救應也。",
            "八字妙用，全在成敗救應，其中權輕權重，甚是活潑。學者從此留心，能於萬變中融以一理，則於命之一道，其庶幾乎！"
        ],
        "content2": []
    },
    {
        "chapter": 10,
        "content": [
            "用神既主月令矣，然月令所藏不一，而用神遂有變化。如十二支中，除子午卯酉外，余皆有藏，不必四庫也。即以寅論，甲爲本主，如郡之有府，丙其長生，如郡之有同知，戊亦長生，如郡之有通判；假使寅月爲提，不透甲而透丙，則如知府不臨郡，而同知得以作主。此變化之由也。",
            "故若丁生亥月，本爲正官，支全卯未，則化爲印。己生申月，本屬傷官。藏庚透壬，則化爲財。凡此之類皆用神之變化也。",
            "變之而善，其格愈美；變之不善，其格遂壞，何謂變之而善？如辛生寅月，逢丙而化財爲官；壬生戌月逢辛而化煞爲印。癸生寅月，不專以煞論。此二者以透出而變化者也。癸生寅月，月令傷官秉令，藏甲透丙，會午會戌，則寅午戌三合，傷化爲財；加以丙火透出，完全作爲財論，即使不透丙而透戊土，亦作財旺生官論。蓋寅午戌三合變化在前，不作傷官見官論也。乙生寅月，月劫秉令，會午會戌，則劫化爲食傷，透戊則爲食傷生財，不作比劫爭財論。此二者因會合而變化者。因變化而忌化爲喜，爲變之善者。",
            "何謂變之而不善？如丙生寅月，本爲印綬，甲不透干而會午會戌，則化爲劫。丙生申月，本屬偏財，藏庚透壬，會子會辰，則化爲煞。如此之類亦多，皆變之不善者也。",
            "又有變之而不失本格者。如辛生寅月，透丙化官，而又透甲，格成正財，正官乃其兼格也。乙生申月，透壬化印，而又透戊，則財能生官，印逢財而退位，雖通月令，格成傷官，百戊官忌見。丙生寅月，午戌會劫，而又或透甲，或透壬，則仍爲印而格不破。丙生申月，逢壬化煞，而又透戊，則食神能制煞生財，仍爲財格，不失富貴。如此之類甚多，是皆變而不失本格者也。",
            "是故八字非用神不立，用神非變化不靈，善觀命者，必於此細詳之。"
        ],
        "content2": []
    }
]