[
    {
        "chapter": 31,
        "content": [
            "官以剋身，雖與七煞有別，終受彼制，何以切忌刑衝破害，尊之若是乎？豈知人生天地間，必無矯焉自尊之理，雖貴極天子，亦有天祖臨之。正官者分所當尊，如在國有君，在家有親，刑衝破害，以下犯上，烏乎可乎？",
            "以刑衝破害爲忌，則以生之護之爲喜矣。存其喜而去其忌則貴，而貴之中又有高低者，何也？以財印並透者論之，兩不相礙，其貴也大。如薛相公命，甲申、壬申、乙巳，戊寅，壬印戊財，以乙隔之，水與土不相礙，故爲大貴。若壬戌、丁未、戊甲、乙卯，雜氣正官，透干會支，最爲貴格，而壬財丁印，二者相合，仍以孤官無輔論，所以不上七品。",
            "若財印不以兩用，則單用印不若單用財，以印能護官，亦能泄官，而財生官也。若化官爲印而透財，則又爲甚秀，大貴之格也。如金狀元命，乙卯、丁亥、丁未、庚戌，此並用財印，無傷官而不雜煞，所謂去其忌而存其喜者也。",
            "然而遇傷在於佩印，混煞貴乎取清。如宣參國命，己卯、辛未、壬寅、辛亥，未中己官透干用清，支會水局，兩辛解之，是遇傷而佩印也。李參政命，庚寅、乙酉、甲子、戊辰，甲用酉官，庚金混雜，乙以合之，合煞留官，是雜煞而取清也。",
            "至於官格透傷用印者，又忌見財，以財能去印，未能生官，而適以護傷故也。然亦有逢財而反大貴者，如范太傅命，丁丑、壬寅、己巳、丙寅，支具巳丑，會金傷官，丙丁解之，透壬豈非破格？卻不知丙丁並透，用一而足，以丁合壬而財去，以丙制傷而官清，無情而愈有情。此正造化之妙，變幻無窮，焉得不貴？",
            "至若地支刑沖，會合可解，已見前篇，不必再述，而以後諸格，亦不談及矣。"
        ],
        "content2": []
    },
    {
        "chapter": 32,
        "content": [
            "取運之道，一八字則有一八字這論，其理甚精，其法甚活，只可大略言之。變化在人，不可泥也。",
            "如正官取運，即以正官所統之格分而配之。正官而用財印，身稍輕則取助身，官稍輕則助官。若官露而不可逢合，不可雜煞，不可重官。與地支刑沖，不問所就何局，皆不利也。",
            "正官用財，運喜印受身旺之地，切忌食傷。若身旺而財輕官弱，即仍取財官運可也。",
            "正官佩印，運喜財鄉，傷食反吉。若官重身輕而佩印，則身旺爲宜，不必財運也。",
            "正官帶傷食而用印製，運喜官旺印旺之鄉，財運切忌。若印綬疊出，財運亦無害矣。",
            "正官而帶煞，傷食反爲不礙。其命中用劫合煞，則財運可行，傷食可行，身旺，印綬亦可行，只不過復露七煞。若命用傷官合煞，則傷食與財俱可行，而不宜逢印矣。",
            "此皆大略言之，其八字各有議論。運中每遇一字，各有研究，隨時取用，不可言形。凡格皆然，不獨正官也。"
        ],
        "content2": []
    },
    {
        "chapter": 33,
        "content": [
            "財爲我剋，使用之物也，以能生官，所以爲美。爲財帛，爲妻妾，爲才能，爲驛馬，皆財類也。",
            "財喜根深，不宜太露，然透一位以清用，格所最喜，不爲之露。即非月令用神，若寅透乙、卯透甲之類，一亦不爲過，太多則露矣。然而財旺生官，露亦不忌，蓋露不忌，蓋露以防劫，生官則劫退，譬如府庫錢糧，有官守護，即使露白，誰敢劫之？如葛參政命，壬申、壬子、戊午、乙卯，豈非財露？唯其生官，所以不忌也。",
            "財格之貴局不一，有財旺生官者，身強而不透傷官，不混七煞，貴格也。",
            "有財用食生者，身強而不露官，略帶一位比劫，益覺有情，如壬寅、壬寅、庚辰、辛巳，楊待郎之命是也。透官身弱，則格壞矣。",
            "有財格佩印者，蓋孤財不貴，佩印幫身，即印取貴。如乙未、甲申、丙申、庚寅，曾參政之命是也，然財印宜相併，如乙未、己卯、庚寅、辛巳，乙與己兩不相能，即有好處，小富而已。",
            "有用食而兼用印者，食與印兩不相礙，或有暗官而去食護官，皆貴格也。如吳榜眼命，庚戌、戊子、戊子、丙辰，庚與丙隔兩戊而不相剋，是食與印不相礙也。如平江伯命，壬辰、乙巳、癸巳、辛酉，雖食印相剋，而欲存巳戊官，是去食護官也。反是則減福矣。",
            "有財用傷官者，財不甚旺而比強，輅露一位傷官以化之，如甲子、辛未、辛酉、壬辰，甲透未庫，逢辛爲劫，壬以化劫生財，汪學士命是也，財旺無劫而透傷，反爲不利，蓋傷官本非美物，財輕透劫，不得己而用之。旺而露傷，何苦用彼？徒使財遇傷而死生官之具，安望富貴乎？",
            "有財帶七煞者，或合煞存財，或制煞生財，皆貴格也，如毛狀元命，乙酉、庚辰、甲午、戊辰，合煞存財也；李御史命，庚辰、戊子、戊寅、甲寅，制煞生財也。",
            "有財用煞印者，黨煞爲忌，印以化之，格成富局，若冬土逢之亦貴格。如趙待郎命，乙丑、丁亥、己亥、丙子，化煞而即以解凍，又不露財以雜其印，所以貴也。若財用煞印而印獨，財煞並透，非特不貴，亦不富也。",
            "至於壬生午月，癸生巳月，單透財而亦貴，又月令有暗官也。如丙寅、癸巳、癸未、壬戌，林尚書命是也。又壬生巳月，單透財而亦貴，以其透丙藏戊，棄煞就財，美者存在贈者棄也。如丙辰、癸巳、壬戌、壬寅，王太僕命是也。",
            "至於劫刃太重，棄財就煞，如一尚書命，丙辰、丙申、丙午、壬辰，此變之又變者也。"
        ],
        "content2": []
    },
    {
        "chapter": 34,
        "content": [
            "財格取運，即以財格所就之局，分而配之。其財旺生官者，運喜身旺印緩，不利七煞傷官；若生官而後透印，傷官之地，不甚有害。至於生官而帶食破局，則運喜印綬，而逢煞反吉矣。",
            "財用食生，財食重而身輕，則喜助身；財食輕而身重，則仍行財食。煞運不忌，官印反晦矣。",
            "財格佩印，運喜官鄉，身弱逢之，最喜印旺。",
            "財用食印，財輕則喜財食，身輕則喜比印，官運有礙，煞反不忌也。",
            "財帶傷官，財運則亨，煞運不利，運行官印，未見其美矣。",
            "財帶七煞。不論合煞制煞，運喜食傷身旺之方。",
            "財用煞印，印旺最宜，逢財必忌。傷食之方，亦任意矣。"
        ],
        "content2": []
    },
    {
        "chapter": 35,
        "content": [
            "印綬喜其生身，正偏同爲美格，故財與印不分偏正，同爲一格而論之。印綬之格局亦不一，有印而透官者，正官不獨取其生印，而即可以爲用，與用煞者不同。故身旺印強，不愁太過，只要官星清純，如丙寅、戊戌、辛酉、戊子，張參政之命是也。",
            "然亦有帶傷食而貴者，則如朱尚書命，丙戌、戊戌、辛未、壬辰，壬爲戊制，不傷官也。又如臨淮侯命，乙亥、己卯、丁酉、壬寅，己爲乙制，己不礙官也。",
            "有印而用傷食者，身強印旺，恐其太過，泄身以爲秀氣。如戊戌、乙卯、丙午、乙亥，李狀元命也，若印淺身輕，而用層層傷食，則寒貧之局矣。",
            "有用偏官者，偏官本非美物，藉其生印，不得已而用之。故必身重印輕，或身輕印重，有所不足，始爲有性。如茅狀元命，己巳、癸酉、癸未、庚申，此身輕印重也。馬參政命，壬寅、戊申、壬辰、壬寅，此身重印輕也。若身印並重而用七煞，非孤則貧矣。",
            "有用煞而兼帶傷食者，則用煞而有制，生身而有泄，不論身旺印重，皆爲貴格。",
            "有印多而用財者，印重身強，透財以抑太過，權而用之，只要根深，無防財破。如辛酉、丙申、壬申、辛亥，汪侍郎命是也。",
            "若印輕財重，又無劫財以救，則爲貪財破印，貧賤之局也。",
            "即或印重財輕而兼露傷食，財與食相生，輕而不輕，即可就富，亦不貴矣。然亦有帶食而貴者，何也？如庚寅、乙酉、癸亥、丙辰，此牛監薄命，乙合庚而不生癸，所以爲貴，若合財存食，又可類推矣。如己未、甲戌、辛未、癸已，此合財存食之貴也。",
            "又有印而兼透官煞者，或合煞，或有制，皆爲貴格。如辛亥、庚子、甲辰、乙亥，此合煞留官也；壬子、癸卯、丙子、己亥、此官煞有制也。",
            "至於化印爲劫；棄之以就財官，如趙知府命，丙午、庚寅、丙午、癸已，則變之又變者矣。",
            "更有印透七煞，而劫財以存煞印，亦有貴格，如庚戌、戊子、甲戌、乙亥是也。然此格畢竟難看，宜細詳之。"
        ],
        "content2": []
    },
    {
        "chapter": 36,
        "content": [
            "印格取運，即以印格所成之局，分而配之。其印綬用官者，官露印重，財運反吉，傷食之方，亦爲最利。",
            "若用官而帶傷食，運喜官旺印綬之鄉，傷食爲害，逢煞不忌矣。",
            "印綬而用傷食，財運反吉，傷食亦利，若行官運，反見其災，煞運則反能爲福矣。",
            "印用七煞，運喜傷食，身旺之方，亦爲美地，一見財鄉，其凶立至。",
            "若用煞而兼帶傷食，運喜身旺印綬之方，傷食亦美，逢官遇財，皆不吉也。",
            "印綬遇財，運喜劫地，官印亦亨，財鄉則忌。",
            "印格而官煞競透，運喜食神傷官，印旺身旺，行之亦利。若再透官煞，行財運，立見其災矣。",
            "印用食傷，印輕者亦不利見財也。"
        ],
        "content2": []
    },
    {
        "chapter": 37,
        "content": [
            "食神本屬泄氣，以其能生正財，所以喜之。故食神生財，美格也。財要有根，不必偏正疊出，如身強食旺而財透，大貴之格。",
            "若丁未、癸卯、癸亥、癸丑，梁丞相之命是也；己未、壬申、戊子、庚申，謝閣老之命是也。",
            "藏食露傷，主人性剛如丁亥、癸卯、癸卯、甲寅，沈路分命是也。偏正疊出，富貴不巨，職甲午、丁卯、癸丑、丙辰，龔知縣命是也。",
            "夏木用財，火炎土燥，貴多就武。如己未、已巳、甲寅、丙寅，黃都督之命是也。",
            "若不用財而就煞印，最爲威權顯赫。如辛卯、辛卯、癸酉、己未，常國公命是也。若無印綬而單露偏官，只要無財，亦爲貴格，如戊戌、壬戌、丙子、戊戌，胡會元命是也。",
            "若金水食神而用煞，貴而且秀，職丁亥、壬子、辛巳、丁酉，舒尚書命是也。至於食神忌印，夏火太炎而木焦，透印不礙，如丙午、癸巳、甲子、丙寅，錢參政命是也。食神忌官，金水不忌，即金水傷官可見官之謂。",
            "至若單用食神，作食神有氣，有財運則富，無財運則貧。",
            "更有印來奪食，透財以解，亦有富貴，須就其全局之勢而斷之。至於食神而官煞競出，亦可成局，但不甚貴耳。",
            "更有食神合煞存財，最爲貴格。",
            "至若食神透煞。本忌見財，而財先煞后，食以間之，而財不能黨煞，亦可就貴。如劉提台命，癸酉、辛酉、己卯、乙亥是也。",
            "其餘變化，不能盡述，類而推之可也。"
        ],
        "content2": []
    },
    {
        "chapter": 38,
        "content": [
            "食神取運，即以食神所成之局，分而配之。食神生財，財重食輕，則行財食，財食重則喜幫身。官煞之方，俱爲不美。",
            "食用煞印，運喜印旺，切忌財鄉。身旺，食傷亦爲福運，行官行煞，亦爲吉也。",
            "食傷帶煞，喜行印綬，身旺，食傷亦爲美運，財則最忌。若食太重而煞輕，印運最利，逢財反吉矣。",
            "食神太旺而帶印，運最利財，食傷亦吉，印則最忌，官煞皆不吉也。",
            "若食神帶印，透財以解，運喜財旺，食傷亦吉，印與官煞皆忌也。"
        ],
        "content2": []
    },
    {
        "chapter": 39,
        "content": [
            "煞以攻身，似非美物，百大貴之格，多存七煞。蓋控制得宜，煞爲我用，如大英雄大豪傑，似難駕馭，而處之有方，則驚天動地之功，忽焉而就。此王侯將相所以多存七煞也。",
            "七煞之格局亦不一：煞用食制者，上也，煞旺食強而身健，極爲貴格。如乙亥、乙酉、乙卯、丁丑，極等之貴也。",
            "煞用食制，不要露財透印，以財能轉食生煞，而印能去食護煞也。然而財先食后，財生煞而食以制之，或印先食后，食太旺而印製，則格成大貴。如脫脫丞相命，壬辰、甲胡、丙戌、戊戌，辰中暗煞，壬以透之，戊坐四支，食太重而透甲印，以損太過，豈非貴格？若煞強食泄而印露，則破局矣。",
            "有七煞用印者，印能護煞，本非所宜，而印有情，便爲貴格。如何參政命，丙寅、戊戌、壬戌、辛丑，戊與辛同通月令，是煞印有情也。",
            "亦有煞重身輕，用食則身不能當，不若轉而就印，雖不通根月令，亦爲無情而有情。格亦許貴，但不大耳。",
            "有煞而用財者，財以黨煞，本非所喜，而或食被制，不能伏煞，而財以去印存食，便爲貴格。如周丞相命，戊戌、甲子，丁未、庚戌，戊被制不能伏煞，時透庚財，即以清食者，生不足之煞。生煞即以制煞，兩得其用，尤爲大貴。",
            "又有身重煞輕，煞又化印，用神不清，而借財以清格，亦爲貴格。如甲申、乙亥、丙戌、庚寅，劉運使命是也。",
            "更有雜氣七煞，幹頭不透財以清用，亦可取貴。",
            "有煞而雜官者，或去官，或去煞，取清則貴。如岳統制命，癸卯、丁巳、庚寅、庚辰，去官留煞也。夫官爲貴氣，去官何如去煞？豈知月令偏官，煞爲用而官非用，各從其重。若官格雜煞而去官留煞，不能如是之清矣。如沈郎中命，丙子、甲午、辛亥、辛卯，子沖午而剋煞，是去煞留官也。",
            "有煞無食制而用印當者，如戊辰、甲寅、戊寅、戊午、趙員外命是也。",
            "至書有制煞不可太過之說，雖亦有理，然運行財印，亦能發福，不可執一也，乃若棄命從煞，則於外格詳之。"
        ],
        "content2": []
    },
    {
        "chapter": 40,
        "content": [
            "偏官取運，即以偏官所成之局分而配之。煞用食制，煞重食輕則助食，煞輕食重則助煞，煞食均而日主根輕則助身。忌正官之混雜，畏印綬之奪食。",
            "煞用印綬，不利財鄉，傷官爲美，印綬身旺，俱爲福地。",
            "七煞用財，其以財而去印存食者，不利劫財，傷食皆吉，喜財怕印，透煞亦順。",
            "其以財而助煞不及者，財已足，則喜食印與幫身；財未足，則喜財旺而露煞。",
            "煞帶正官，不論去官留煞，去煞留官，身輕則喜助身，食輕則喜助食。莫去取清之物，無傷制煞之神。",
            "煞無食制而用刃當煞，煞輕刃重則喜助煞，刃輕煞重，則宜制伏，無食可奪，印運何傷？七煞既純，雜官不利。"
        ],
        "content2": []
    }
]