[
    {
        "chapter": 21,
        "content": [
            "八字格局，專以月令配四柱，至於星辰好歹，既不能爲生剋之用，又何以操成敗之權？況於局有礙，即財官美物，尚不能濟，何論吉星？於局有用，即七煞傷官，何謂凶神乎？是以格局既成，即使滿盤孤辰入煞，何損其貴？格局既破，即使満盤天德貴人，何以爲功？今人不知輕重，見是吉星，遂致拋卻用神，不管四柱，妄論貴賤，謬談禍福，甚可笑也。",
            "況書中所云祿貴，往往指正官而言，不是祿堂人貴人。如正財得傷貴爲奇，傷貴也，傷官乃生財之具，正財得之，所以爲奇，若指貴人，則傷貴爲何物乎？又若因得祿而避位，得祿者，得官也，運得官鄉，宜乎進爵，然如財用傷官食神，運透官則格條，正官運又遇官則重，凡此之類，只可避位也。若作祿堂，不獨無是理，抑且得祿避位，文法上下相顧。古人作書，何至不通若是！",
            "又若女命，有雲“貴眾則舞裙歌扇”。貴眾者，官眾也，女以官爲夫，正夫豈可疊出乎？一女眾夫，舞裙歌扇，理固然也。若作貴人，乃是天星，並非夫主，何礙於眾，而必爲娼妓乎？",
            "然星辰命書，亦有談及，不善看書者執之也。如“貴人頭上帶財官，門充馳馬”，蓋財官如人美貌，貴人如人衣服，貌之美者，衣服美則現。其實財官成格，即非貴人頭上，怕不門充馳馬！又局清貴，又帶二德，必受榮封。若專主二德，則何不竟雲帶二德受兩國之封，而秘先曰無煞乎？若雲命逢險格，柱有二德，逢凶有救，右免於危，則亦有之，然終無關於格局之貴賤也。"
        ],
        "content2": []
    },
    {
        "chapter": 22,
        "content": [
            "八字用神既專主月令，何以又有外格乎？外格者，蓋因月令無用，權而用之，故曰外格也。",
            "如春木冬水、土生四季之類，日與月同，難以作用，類象、屬象、沖財、會祿、刑合、遙迎、井欄、朝陽諸格，皆可用也。若月令自有用神，豈可另尋外格？又或春木冬水，幹頭已有財官七煞，而棄之以就外格，亦太謬矣。是故幹頭有財，何用沖財？",
            "幹頭有官，何用合祿？書雲“提綱有用提綱重”，又曰“有官莫尋格局”，不易之論也。",
            "然所謂月令無用者，原是月令本無用神，而今人不知，往往以財被劫官被傷之類。用神已破，皆以爲月令無取，而棄之以就外格，則謬之又謬矣。"
        ],
        "content2": []
    },
    {
        "chapter": 23,
        "content": [
            "人有六親，配之八字，亦存於命。",
            "其由宮分配之者，則年月日時，自上而下，祖父妻子，亦自上而下。以地相配，適得其宜，不易之位也。",
            "其由用神配之者，則正印也母，身所自出，取其生我也。若偏財受我剋制，何反爲父？偏財者，母之正夫也，正印爲母，則偏才爲父矣。正財爲妻，受我剋制，夫爲妻綱，妻則從夫。若官煞則剋制乎我，何以反爲子女也？官煞者，財所生也，財爲妻妾，則官煞爲子女矣。至於比肩爲兄弟，又理之顯然者。",
            "其間有無得力，或吉或凶，則以四柱所存或年月或日時財官傷刃，系是何物，然後以六親配之用神。局中作何喜忌，參而配之，可以瞭然矣。"
        ],
        "content2": []
    },
    {
        "chapter": 24,
        "content": [
            "大凡命中吉凶，於人愈近，其驗益靈。富貴貧賤，本身之事，無論矣，至於六親，妻以配身，子爲後嗣，亦是切身之事。故看命者，妻財子提綱得力，或年干有用，皆主父母身所自出，亦自有驗。所以提綱得力，或年干有用，皆主父母雙全得力。至於祖宗兄弟，不甚驗矣。",
            "以妻論之，坐下財官，妻當賢貴；然亦有坐財官而妻不利，逢傷刃而妻反吉者，何也？此蓋月令用神，配成喜忌。如妻宮坐財，吉也，而印格逢之，反爲不美。妻坐官，吉也，而傷官逢之，豈能順意？妻坐傷官，凶也，而財格逢之，可以生堸，煞格逢之，可以制煞，反主妻能內助。妻坐陽刃，凶也，而或財官煞傷等格，四柱已成格局，而日主無氣，全憑日刃幫身，則妻必能相關。其理不可執一。",
            "既看妻宮，又看妻星。妻星者，幹頭之財也。妻透而成局，若官格透財、印多逢財、食傷透財爲用之類，即坐下無用，亦主內助。妻透而破格，若印輕財露、食神傷官、透煞逢財之類，即坐下有用，亦防刑剋。又有妻透成格，或妻宮有用而坐下刑沖，未免得美妻而難偕老。又若妻星兩透，偏正雜出，何一夫而多妻？亦防刑剋之道也。",
            "至於子息，其看宮分與星所透喜忌，理與論妻略同。但看子息，長生沐浴之歌，亦當熟讀，如“長生四子中旬半，沐浴一雙保吉祥，冠帶臨官三子位，旺中五子自成行，衰中二子病中一，死中至老沒兒郞，除非養取他之子，入墓之時命夭亡，受氣爲絕一個子，胎中頭產養姑娘，養中三子只留一，男子宮中子細詳”是也。",
            "然長生論法，用陽而不用陰。如甲乙日只用庚金長生，巳酉丑順數之局，而不用辛金逆數之子申辰。雖書有官爲女煞爲男之說，然終不可以甲用庚男而用陽局，乙用辛男而陰局。蓋木爲日主，不問甲乙，總以庚爲男辛爲女，其理爲然，拘於官煞，其能驗乎？",
            "所以八字到手，要看子息，先看時支。如甲乙生日，其時果系庚金何宮？或生旺，或死絕，其多寡已有定數，然後以時乾子星配之。如財格而時干透食，官格而時干透財之類，皆謂時干有用，即使時逢死絕，亦主子貴，但不甚繁耳。若又逢生旺，則麟兒繞膝，豈可量乎？若時干不好，子透破局，即逢生旺，難爲子息。若又死絕，無所望矣。此論妻子之大略也。"
        ],
        "content2": []
    },
    {
        "chapter": 25,
        "content": [
            "論運與看命無二法也。看命以四柱干支，配月令之喜忌，而取運則又以運之干，配八字之喜忌。故運中每運行一字，即必以此一字，配命中干支而統觀之，爲喜爲忌，吉凶判然矣。",
            "何爲喜？命中所喜之神，我得而助之者是也。如官用印以制傷，而運助印；財生官而身輕，而運助身；印帶財以爲忌，而運劫財；食帶煞以成格，身輕而運逢印，煞重而運助食；傷官佩印，而運行官煞；陽刃用官，而運助財鄉；月劫用財，而運行傷食。如此之類，皆美運也。",
            "何謂忌？命中所忌，我逆而施之者是也。如正官無印，而運行傷；財不透食，而運行煞；印綬用官，而運合官；食神帶煞，而運行財；七煞食制，而運逢梟；傷官佩印，而運行財；陽刃用煞，而運逢食；建祿用官，而運逢傷。如此之類，皆敗運也。",
            "其有似喜而實忌者，何也？如官逢印運，而本命有合，印逢官運，而本命用煞之類是也。",
            "有似忌而實喜者，何也？如官逢傷運，而命透印，財行煞運，而命透食之類是也。",
            "又有行干而不行支者，何也？如丙生子月亥年，逢丙丁則幫身，逢巳午則相衝是也。",
            "又有行支而不行干者，何也？如甲生酉月，辛金透而官猶弱，逢申酉則官植根，逢庚辛則混煞重官之類是也。",
            "又有干同一類而不兩行者，何也？如丁生亥月，而年透壬官，逢丙則幫身，逢丁則合官之類是也。",
            "又有支同一類而不兩行者，何也？如戊生卯月，丑年，逢申則自坐長生，逢酉則會丑以傷官之類是也。",
            "又有同是相衝而分緩急者，何也？沖年月則急，沖日時則緩也。",
            "又有同是相衝而分輕重者，何也？運本美而逢沖則輕，運既忌面又沖則重也。",
            "又有逢沖而不沖，何也？如甲用酉官，行卯則沖，而本命巳酉相會，則沖無力；年支亥未，則卯逢年會而不沖月官之類是也。",
            "又有一衝而得兩沖者，何也？如乙用申官，兩申並而不沖一寅，運又逢寅，則運與本命，合成二寅，以沖二申之類是也。"
        ],
        "content2": []
    },
    {
        "chapter": 26,
        "content": [
            "命之格局，成於八字，然配之以運，亦有成格變格之要權。其成格變格，較之喜忌禍福尤重。",
            "何爲成格？本命用神，成而未全，從而就之者是也。如丁生辰月，透壬爲宮，而運逢申子以會之；乙生辰月，或申或子會印成局，而運逢壬癸以透之。如此之類，皆成格也。",
            "何爲變格？如丁生辰月，透壬爲官，而運逢戌，透出辰中傷官；壬生戌月，丁己並透，而支又會寅會午，作財旺生官矣，而運逢戊土，透出戌中七煞；壬生亥月，透己爲用，作建祿用官矣，而運逢卯未，會亥成本，又化建祿爲傷。如此之類，皆變格也。",
            "然亦有逢成格而不喜者，何也？如壬生午月，運透己官，而本命有甲乙之類是也。",
            "又有逢變格而不忌者，何也？如丁生辰月，透壬用官，逢戊而命有甲；壬生亥月，透己用官，運逢卯未，而命有庚辛之類是也。",
            "成格變格，關係甚大，取運者其細詳之。"
        ],
        "content2": []
    },
    {
        "chapter": 27,
        "content": [
            "命中喜忌，雖支幹俱有，而干主天，動而有爲，支主地，靜以待用，且干主一而支藏多，爲福爲禍，安不得殊？",
            "譬如甲用酉官，逢庚辛則官煞雜，而申酉不作此例。申亦辛之旺地，辛坐申酉，如府官又掌道印也。逢二辛則官犯重，而二酉不作此例。辛坐二酉，如一府而攝二郡也，透丁則傷官，而逢午不作此例。丁動而午靜，且丁巳並藏，安知其爲財也？",
            "然亦有支而能作禍福者，何也？如甲用酉官，逢午酉未能傷，而又遇寅遇戌，不隔二位，二者合而火動，亦能傷矣。即此反觀，如甲生甲月，午不制煞，會寅會戌，二者清局而火動，亦能矣。然必會有動，是正與干有別也。即此一端，余者可知。"
        ],
        "content2": []
    },
    {
        "chapter": 28,
        "content": [
            "支中喜忌，固與干有別矣，而運逢透清，則靜而待用者，正得其用，而喜忌之驗，於此乃見。何謂透清？如甲用酉官，逢辰未即爲財，而運透戊，逢午未即爲傷，而運透丁之類是也。",
            "若命與運二支會局，亦作清論。如甲用酉官，本命有午，而運逢寅戌之類。然在年則重，在日次之，至於時生於午，而運逢寅戌會局，則緩而不急矣。雖格之成敗高低，八字已有定論，與命中原有者不同，而此五年中，亦能炒其禍福。若月令之物，而運中透清，則與命中原有者，不甚相懸，即前篇所謂行運成格變格是也。",
            "故凡一八字到手，必須逐干逐支，上下統看。支爲干之生地，干爲支之發用。如命中有一甲字，則統觀四支，有寅亥卯未等字否，有一字，皆甲木之根也。有一亥字，則統觀四支，有壬甲二字否。有壬，則亥爲壬祿，以壬水用；用甲，則亥爲甲長生，以甲木用；用壬甲俱全，則一以祿爲根，一以長生爲根，二者並用。取運亦用此術，將本命八字，逐干支配之而已。"
        ],
        "content2": []
    },
    {
        "chapter": 29,
        "content": [
            "八字用神專憑月令，月無用神，台尋格局。月令，本也；外格，未也。今人不知輕重，拘泥格局，執假失真。",
            "故戊生甲寅之月，時上庚甲，不以爲明煞有制，而以爲專食之格，逢甲減福。",
            "丙生子月，時逢巳祿，不以爲正官之格，歸祿幫身，而以爲日祿歸時，逢官破局。",
            "辛日透丙，時遇戊子，不以爲辛日得官逢印，而以爲朝陽之格，因丙無成。",
            "財逢時煞，不以爲生煞攻身，而以爲時上偏官。",
            "癸生巳月，時遇甲寅，不以爲暗官受破，而以爲刑合成格。",
            "癸生冬月，酉日亥時，透戊坐戌，不以爲月劫建祿，用官通根，而以爲拱戌之格，填實不利。辛日坐丑，寅年，亥月，卯時，不以爲正財之格，而以爲填實拱貴。",
            "乙逢寅月，時遇丙子，不以爲木火通明，而以爲格成鼠貴。",
            "如此謬論，百無一是，此皆由不知命理，妄爲評斷。"
        ],
        "content2": []
    },
    {
        "chapter": 30,
        "content": [
            "八字本有定理，理之不明，遂生導端，妄言妄聽，牢不可破。如論干支，則不知陰陽之理，而以俗書體象歌訣爲確論；論格局，則不知專尋月令，而以拘泥外格爲活變；論生剋，則不察喜忌，而以傷旺扶弱爲定法；論行運，則不問同中有導，而以干支相類爲一例。",
            "究其緣由，一則書中用字輕重，不知其意，而謬生偏見；一則以鵒書無知妄作，誤會其說，而深入迷途；一則論命取運，偶然湊合，而遂以己見爲不易，一則以古人命式，亦有誤收，即收之不誤，又以己意入外格，尤爲害人不淺。",
            "如壬申、癸丑、己丑、甲戌，本雜氣財旺生官也，而以爲乙亥時，作時上偏官論，豈知旺財生煞，將救死之不暇，於何取貴？",
            "此類甚多，皆誤收格局也。如己未、壬申、戊子、庚申，本食神生財也，而欲棄月令，以爲戊日庚申合祿之格，豈知本身自有財食，豈不甚美？又何勞以庚合乙，求局外之官乎，此類甚多，皆硬入外格也。",
            "人苟中無定見，察理不精，睹此謬論，豈能無惑？何況近日貴格不可解者，亦往往有之乎？豈知行術之人，必以貴命爲指歸，或將風聞爲實據，或探其生日，而即以己意加之生時，謬造貴格，其人之八字，時多未確，即彼本身，亦不自知。若看命者不究其本，而徒以彼既富貴遷就其說以相從，無惑乎終身無解日矣！"
        ],
        "content2": []
    }
]