[
    {
        "chapter": 11,
        "content": [
            "用神既有變化，則變化之中，遂分純、雜。純者吉，雜者凶。",
            "何謂純？互用而兩相得者是也。如辛生寅月，甲丙並透，財與官相生，兩相得也。戊生申月，庚壬並透，財與食相生，兩相得也。癸生未月，乙己並透，煞與食相剋，相剋而得其當，亦兩相得也。如此之類，皆用神之純者。",
            "何謂雜？互用而兩不相謀者是也。如壬生未月，乙己並透，官與傷相剋，兩不相謀也。甲也辰月，戊壬並透，印與財相剋，亦兩不相謀也。如此之類，皆用之雜者也。",
            "純雜之理，不出變化，分而疏之，其理愈明，學命者不可不知也。"
        ],
        "content2": []
    },
    {
        "chapter": 12,
        "content": [
            "八字既有用神，必有格局，有格局必有高低，財官印食煞傷劫刃，何格無貴？何格無賤？由極貴而至極賤，萬有不齊，其變千狀，豈可言傳？然其理之大綱，亦在有情、有力無力之間而已。",
            "如正官佩印，不如透財，而四柱帶傷，反推佩印。故甲透酉官，透丁合壬，是謂合傷存官，遂成貴格，以其有情也。財忌比劫，而與煞作合，劫反爲用。故甲生辰月，透戊成格，遇乙爲劫，逢庚爲煞，二者相合，皆得其用，遂成貴格，亦以其有情也。",
            "身強煞露而食神又旺，如乙生酉月，辛金透，丁火剛，秋木盛，三者皆備，極等之貴，以其有力也。官強財透，身逢祿刃，如丙生子月，癸水透，庚金露，而坐寅午，三者皆均，遂成大貴，亦以其有力也。",
            "又有有情而兼有力，有力而兼有情者。如甲用酉官，壬合丁以清官，而壬水根深，是有情而兼有力者也。乙用酉煞，辛逢丁制，而辛之祿即丁之長生，同根月令，是有力而兼有情者也。是皆格之最高者也。",
            "如甲用酉官，透丁逢癸，癸剋不如壬合，是有情而非情之至。乙逢酉逢煞，透丁以制，而或煞強而丁稍弱，丁旺而煞不昂，又或辛丁並旺而乙根不甚深，是有力而非力之全，格之高而次者也。",
            "至如印用七煞，本爲貴格，而身強印旺，透煞孤貧，蓋身旺不勞印生，印旺何勞煞助？偏之又偏，以其無情也。傷官佩印，本秀而貴，而身主甚旺，傷官甚淺，印又太重，不貴不秀，蓋欲助身則身強，制傷則傷淺，要此重印何用？是亦無情也。又如煞強食旺而身無根，身強比重而財無氣，或夭或貧，以其無力也。是皆格之低而無用者也。",
            "然其中高低之故，變化甚微，或一字而有千鈞之力，或半字而敗全局之美，隨時觀理，難以擬議，此特大略而已。"
        ],
        "content2": []
    },
    {
        "chapter": 13,
        "content": [
            "八字之中，變化不一，遂分成敗；而成敗之中，又變化不測，遂有因成得敗，因敗得成之奇。",
            "是故化傷爲財，格之成也，然辛生亥月，透丁爲用，卯未會財，乃以黨煞，因成得敗矣。印用七煞，格之成也，然癸生申月，秋金重重，略帶財以損太過，逢煞則煞印忌財，因成得敗也。如此之類，不可勝數，皆因成得敗之例也。",
            "官印逢傷，格之敗也，然辛生戊戌月，年丙時壬，壬不能越戊剋丙，而反能泄身爲秀，是因敗得成矣。煞刃逢食，格之敗也，然庚生酉月，年丙月丁，時上逢壬，則食神合官留煞，而官煞不雜，煞刃局清，是因敗得成矣。如此之類，亦不可勝數，皆因敗得成之例也。",
            "其間奇奇怪怪，變幼無窮，惟以理權衡之，隨在觀理，因時運化，由他奇奇怪怪，自有一種至當不易不論。觀命者毋眩而無主、執而不化也。"
        ],
        "content2": []
    },
    {
        "chapter": 14,
        "content": [
            "論命惟以月令用神爲主，然亦須配氣候而互參之。譬如英雄豪傑，生得其時，自然事半功倍；遭時不順，雖有奇才，成功不易。",
            "是以印綬遇官，此謂官印雙全，無人不貴。而冬木逢水，雖透官星，亦難必貴，蓋金寒而水益凍，凍水不能生木，其理然也。身印兩旺，透食則貴，凡印格皆然。而用之冬木，尤爲秀氣，以冬木逢火，不惟可以泄身，而即可以調候也。",
            "傷官見官，爲禍百端，而金水見之，反爲秀氣。非官之不畏夫傷，而調候爲急，權而用之也。傷官帶煞，隨時可用，而用之冬金，其秀百倍。",
            "傷官佩印，隨時可用，而用之夏木，其秀百倍，火濟水，水濟火也。",
            "傷官用財，本爲貴格，而用之冬水，即使小富，亦多不貴，凍水不能生木也。",
            "傷官用財，即爲秀氣，而用之夏木，貴而不甚秀，燥土不甚靈秀也。",
            "春木逢火，則爲木爲通明，而夏木不作此論；秋金遇水，則爲金水相涵，而冬金不作此論。氣有衰旺，取用不同也。春木逢火，木火通明，不利見官；而秋金遇水，金水相涵，見官無礙。假如庚生申月，而支中或子或辰，會成水局，天干透丁，以爲官星，只要壬癸不透露幹頭，便爲貴格，與食神傷官喜見官之說同論，亦調候之道也。",
            "食神雖逢正印，亦謂奪食，而夏木火盛，輕用之亦秀而貴，與木火傷官喜見水同論，亦調候之謂也。",
            "此類甚多，不能悉述，在學者引伸觸類，神而明之而已。"
        ],
        "content2": []
    },
    {
        "chapter": 15,
        "content": [
            "月令既得用神，則別位亦必有相，若君之有相，輔者是也。如官逢財生，則官爲用，財爲相；財旺生官，則財爲用，官爲相；煞逢食制，則煞爲用，食爲相。然此乃一定之法，非通變之妙。要而言之，凡全局之格，賴此一字而成者，均謂之相也。",
            "傷用神甚於傷身，傷相甚於傷用。如甲用酉官，透丁逢壬，則合傷存官以成格者，全賴壬之相；戊用子財，透甲並己，則合煞存財以成格者，全賴己之相；乙用酉煞，年丁月癸，時上逢戊，則合去癸印以使丁得制煞者，全賴戊之相。",
            "癸生亥月，透丙爲財，財逢月劫，而卯未來會，則化水爲木而轉劫以生財者，全賴於卯未之相。庚生申月，透癸泄氣，不通月令而金氣不甚靈，子辰會局，則化金爲水而成金水相涵者，全賴於子辰之相。如此之類，皆相神之緊要也。",
            "相神無破，貴格已成；相神相傷，立敗其格。如甲用酉官，透丁逢癸印，制傷以護官矣，而又逢戊，癸合戊而不制丁，癸水之相傷矣；丁用酉財，透癸逢己，食制煞以生財矣，而又透甲，己合甲而不制癸，己土之相傷矣。是皆有情而化無情，有用而成無用之格也。",
            "凡八字排定，必有一種議論，一種作用，一種棄取，隨地換形，難以虛擬，學命者其可忽諸？"
        ],
        "content2": []
    },
    {
        "chapter": 16,
        "content": [
            "四墓者，沖氣也，何以謂之雜氣？以其所藏者多，用神不一，故謂之雜氣也。如辰本藏戊，而又爲水庫，爲乙餘氣，三者俱有，於何取用？然而甚易也，透干會取其清者用之，雜而不雜也。",
            "何謂透干？如甲生辰月，透戊則用偏財，透癸則用正印，透乙則用月劫是也。何謂會支？如甲生辰月，逢申與子會局，則用水印是也。一透則一用，兼透則兼用，透而又會，則透與會並用。其合而有情者吉，其合而無情者則不吉。",
            "何謂有情？順而相成者是也。如甲生辰月，透癸爲印，而又會子會申以成局，印綬之格，清而不雜，是透干與會支，合而有情也。又如丙生辰月，透癸爲官，而又逢乙以爲印，官與印相生，而印又能去辰中暗土以清官，是兩干並透，合而情也。又如甲生丑月，辛透爲官，或巳酉會成金局，而又透己財以生官，是兩干並透，與會支合而有情也。",
            "何謂無情？逆而相背者是也。如壬生未月，透己爲官，而地支會亥卯以成傷官之局，是透官與會支，合而無情者也。又如甲生辰月，透戊爲財，又或透壬癸以爲印，透癸則戊癸作合，財印兩失，透壬則財印兩傷，又以貪財壞印，是兩干並透，合而無情也。又如甲生戌月，透辛爲官，而又透丁以傷官，月支又會寅會午以成傷官之局，是兩干並透，與會支合而無情也。",
            "又有有情而卒成無情者，何也？如甲生辰月，逢壬爲印，而又逢丙，印綬本喜泄身爲秀，似成格矣，而火能生土，似又助辰中之戊，印格不清，是必壬干透而支又會申會子，則透丙亦無所礙。又有甲生辰月，透壬爲印，雖不露丙而支逢戌位，戌與辰沖，二者爲月沖而土動，幹頭之壬難通月令，印格不成，是皆有情而卒無情，富而不貴者也。",
            "又有無情而終有情者，何也？如癸生辰月，透戊爲官，又有會申會子以成水局，透干與會支相剋矣。然所剋者乃是劫財，譬如月劫用官，何傷之有？又如丙生辰月，透戊爲食，而又透壬爲煞，是兩干並透，而相剋也。然所剋者乃是偏官，譬如食神帶煞，煞逢食制，二者皆是美格，其局愈貴。是皆無情而終爲有情也。",
            "如此之類，不可勝數，即此爲例，旁悟而已。"
        ],
        "content2": []
    },
    {
        "chapter": 17,
        "content": [
            "辰戌丑未，最喜刑沖，財官入庫不沖不發——此說雖俗書盛稱之，然子平先生造命，無是說也。夫雜氣透干會支，豈不甚美？",
            "又何勞刑沖乎？假如甲生辰月，戊土透豈非偏財？申子會豈非印綬？若戊土不透，即辰戌相衝，財格猶不甚清也。至於透壬爲印，辰戌相衝，將以累印，謂之沖開印庫可乎？",
            "況四庫之中，雖五行俱有，而終以土爲主。土沖則靈，金木水火，豈取勝以四庫之沖而動乎？故財官屬土，沖則庫啟，如甲用戊財而辰戌沖，壬用己官而丑未沖之類是也。然終以戊己幹頭爲清用，干既透，即不沖而亦得也。至於財官爲水，沖則反累，如己生辰月，壬透爲財，戌沖則劫動，何益之有？丁生辰月，透壬爲官，戌沖則傷官，豈能無害？其可謂之逢沖而壬水之財庫官庫開乎？",
            "今人不知此理，甚有以出庫爲投庫。如丁生辰月，壬官透干，不以爲庫內之壬，幹頭透出，而反爲幹頭之壬，逢辰入庫，求戌以沖土，不顧其官之傷。更有可笑者，月令本非四墓，別有用神，年月日時中一帶四墓，便求刑沖；日臨四庫不以爲身坐庫根，而以爲身主入庫，求沖以解。種種謬論，令人掩耳。",
            "然亦有逢沖而發者，何也？如官最忌沖，而癸生辰月，透戊爲官，與戌相衝，不見破格，四庫喜沖，不爲不足。卻不知子午卯酉之類，二者相仇，乃衝剋之沖，而四墓土自爲沖，乃衝動之沖，非衝剋之沖也。然既以土爲官，何害於事乎？",
            "是故四墓不忌刑沖，刑沖未必成格。其理甚明，人自不察耳。"
        ],
        "content2": []
    },
    {
        "chapter": 18,
        "content": [
            "財官印食，四吉神也，然用之不當，亦能破格。",
            "如食神帶煞，透財爲害，財能破格也；春木火旺，見官則忌，官能破格也；煞逢食制，透印無功，印能破格也；財旺生官，露食則雜，食能破格也。",
            "是故官用食破，印用財破。譬之用藥，參苓芪術，本屬良材，用之失宜，亦能害人。官忌食傷，財畏比劫，印懼財破，食畏印奪，參合錯綜，各極其妙。弱者以生扶爲喜，強者因生扶而反害；衰者以裁抑爲忌，太旺者反以裁抑而得益。吉凶喜忌，全在是否合於需要，不因名稱而有分別也。"
        ],
        "content2": []
    },
    {
        "chapter": 19,
        "content": [
            "煞傷梟刃，四凶神也，然施之得宜，亦能成格。如印綬根輕，透煞爲助，煞能成格也。財逢比劫，傷官可解，傷能成格也。食神帶煞，靈梟得用，梟能成格也。財逢七煞，刃可解厄，刃能成格也。",
            "是故財不忌傷，官不忌梟，煞不忌刃，如治國長搶大戟，本非美具，而施之得宜，可以戡亂。"
        ],
        "content2": []
    },
    {
        "chapter": 20,
        "content": [
            "月令用神，配以四柱，固有每字之生剋以分吉凶，然有同此生剋，而先後之間，遂分吉凶者，尤談命之奧也。",
            "如正官同是財傷並透，而先後有殊。假如甲用酉官，丁先戊后，后則以財爲解傷，即不能貴，后運必有結局。若戊先而丁后時，則爲官遇財生，而後因傷破，即使上運稍順，終無結局，子嗣亦難矣。",
            "印格同是貪格壞印，而先後有殊。如甲用子印，己先癸后，即使不富，稍順晚境；若癸先而己在時，晚景亦悴矣。",
            "食神同是財梟並透，而先後有殊。如壬用甲食，庚先丙后，晚運必亨，格亦富而望貴。若丙先而庚在時，晚運必淡，富貴兩空矣。",
            "七煞同是財食並透，而先後大殊。如己生卯月，癸先辛后，則爲財以助用，而後煞用食制，不失大貴。若辛先而癸在時，則煞逢食制，而財轉食黨煞，非特不貴，后運蕭索，兼難永壽矣。",
            "他如此類，可以例推。然猶吉凶易者也，至丙生甲寅月，年癸時戊，官能生印，而不怕戊合；戊能泄身爲秀，而不得越甲以合癸，大貴之格也。假使年月戊癸而時甲，或年甲而月癸時戊，則戊無所隔而合全癸，格大破矣。",
            "丙生辛酉，年癸時己，傷因財間，傷之無力，間有小貴。假如癸己產並而中無辛隔，格盡破矣。",
            "辛生申月，年壬月戊，時上丙官，不愁隔戊之壬，格亦許貴。假使年丙月壬而時戊，或年戊月丙而時壬，則壬能剋丙，無望其貴矣。",
            "如此之類，不可勝數，其中吉凶似難猝喻。然細思其故，理甚顯然，特難爲淺者道耳。"
        ],
        "content2": []
    }
]